#编写一个函数，输入的是一个无符号整数，返回其二进制表达式中数字为1的位的个数。
#输入：00000000000000000000000000001011 输出：3
#解释：在输入的二进制串00000000000000000000000000001011中，共有3位为1。

#输入：00000000000000000000000010000000 输出：1
#解释：在输入的二进制串00000000000000000000000010000000中，共有1位为1。

#输入：11111111111111111111111111111101 输出：31
#解释：在输入的二进制串11111111111111111111111111111101中，共有31位为1。
def hammingWeight(n):
    count = 0
    while n:
        
        n &= (n - 1)
        count += 1
    return count

result1 = hammingWeight(0b00000000000000000000000000001011)
print(result1)  # 输出: 3

result2 = hammingWeight(0b00000000000000000000000010000000)
print(result2)  # 输出: 1

result3 = hammingWeight(0b11111111111111111111111111111101)
print(result3)  # 输出: 31
